Revit 2027 API
BuiltInFailures.MEPCalculationFailures.LoopSeparationNotCompleted Property
 The loop separation is not completed yet. Only one side of the secondary/tertiary loop is separated. In order to correctly calculate the flow and pressure loss, please check and separate the other end of the loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LoopSeparationNotCompleted { get; }
Public Shared ReadOnly Property LoopSeparationNotCompleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LoopSeparationNotCompleted {
	FailureDefinitionId^ get ();
}
static member LoopSeparationNotCompleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace